In [1]:
import pandas as pd

In [2]:
col_names = ['Student ID', 'Name', 'Marks1', 'Marks2', 'Marks3', 'Marks4', 'Marks5', 'Marks6']
df = pd.DataFrame(columns = col_names)

In [3]:
df

Empty DataFrame
Columns: [Student ID, Name, Marks1, Marks2, Marks3, Marks4, Marks5, Marks6]
Index: []

In [4]:
stud1 = {'Student ID':2, 'Name': 'E', 'Marks1':45, 'Marks2':71, 'Marks3':67, 'Marks4':78, 'Marks5':56, 'Marks6':85}
df =df.append(stud1, ignore_index=True)

In [5]:
df

  Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
0          2    E     45     71     67     78     56     85

In [6]:
stud1 = pd.DataFrame({'Student ID':[5], 'Name': ['D'], 'Marks1':[32], 'Marks2':[90], 'Marks3':[39], 
                      'Marks4':[67], 'Marks5':[43], 'Marks6':[54]})
df = pd.concat([df, stud1], axis=0, ignore_index=True)

In [7]:
df

  Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
0          2    E     45     71     67     78     56     85
1          5    D     32     90     39     67     43     54

In [8]:
df.loc[-1] = [8, 'V', 65, 67, 72, 75, 66, 81]

In [9]:
df

   Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
 0          2    E     45     71     67     78     56     85
 1          5    D     32     90     39     67     43     54
-1          8    V     65     67     72     75     66     81

In [10]:
df.loc[2] = [4, 'A', 39, 51, 76, 78, 80, 91]

In [11]:
df

   Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
 0          2    E     45     71     67     78     56     85
 1          5    D     32     90     39     67     43     54
-1          8    V     65     67     72     75     66     81
 2          4    A     39     51     76     78     80     91

In [12]:
df.index = df.index + 1
df = df.sort_index()

In [13]:
df

  Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
0          8    V     65     67     72     75     66     81
1          2    E     45     71     67     78     56     85
2          5    D     32     90     39     67     43     54
3          4    A     39     51     76     78     80     91

In [14]:
sum = df['Marks1']+df['Marks2']+df['Marks3']+df['Marks4']+df['Marks5']+df['Marks6']
print(sum)

0    426
1    402
2    325
3    415
dtype: object

In [15]:
per = sum/6
print(per)

0         71
1         67
2    54.1667
3    69.1667
dtype: object

In [16]:
df["per"] = per
print(df)

  Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6      per
0          8    V     65     67     72     75     66     81       71
1          2    E     45     71     67     78     56     85       67
2          5    D     32     90     39     67     43     54  54.1667
3          4    A     39     51     76     78     80     91  69.1667

In [17]:
print(df[['Student ID', 'Name']][df.per == df.per.max()])

  Student ID Name
0          8    V

In [18]:
df.to_csv("file.csv")

In [19]:
df

  Student ID Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6      per
0          8    V     65     67     72     75     66     81       71
1          2    E     45     71     67     78     56     85       67
2          5    D     32     90     39     67     43     54  54.1667
3          4    A     39     51     76     78     80     91  69.1667